In [1]:
import pandas as pd

In [5]:
df_clients = pd.read_excel('case.xlsx', sheet_name='clients')
df_stores = pd.read_excel('case.xlsx', sheet_name='stores')
df_products = pd.read_excel('case.xlsx', sheet_name='products')
df_sales = pd.read_excel('case.xlsx', sheet_name='sales')
df_payments = pd.read_excel('case.xlsx', sheet_name='payments')

In [6]:
df_clients

       id               name sex  birth_date
0       1      Lavinia Sousa   F    5/2/1975
1       2       Caio Pereira   M   4/16/1978
2       3      Júlio Azevedo   M   11/4/1952
3       4    Sarah Goncalves   F   2/24/1937
4       5  Gabrielle Martins   F    5/6/1953
..    ...                ...  ..         ...
995   996     Ágatha Ribeiro   F    2/8/1946
996   997     Laura Oliveira   F   6/15/1979
997   998      Lara Oliveira   F   3/15/1946
998   999       Julian Cunha   M   6/20/1994
999  1000    Gustavo Barbosa   M  12/30/1975

[1000 rows x 4 columns]

In [7]:
df_stores

   id            city
0   1       São Paulo
1   2  Rio de Janeiro
2   3        Curitiba
3   4  Belo Horizonte
4   5  Santa Catarina
5   6          Recife
6   7        Salvador
7   8        Brasília
8   9          Palmas
9  10         Vitória

In [8]:
df_products

   id        product      value
0   1          mouse       20.0
1   2        teclado       30.0
2   3  laptop básico     2300.0
3   4   laptop gamer     5300.0
4   5        monitor     1500.0
5   6     impressora      700.0
6   7     carregador      150.0
7   8        cadeira      540.0
8   9           mesa      860.0
9  10       xxx-231a  3211352.0

In [9]:
df_sales

        id  id_cliente  id_store  id_product    dt_sale
0        1         393         9           3 2018-01-04
1        2         417         9           3 2018-01-04
2        3         374         7           8 2018-01-04
3        4          59         4           3 2018-01-05
4        5          18         9           1 2018-01-05
...    ...         ...       ...         ...        ...
2995  2996         671         3           7 2020-09-27
2996  2997         586         8           3 2020-09-27
2997  2998         731         2           4 2020-09-27
2998  2999         163         2           1 2020-09-27
2999  3000         770         2           2 2020-09-27

[3000 rows x 5 columns]

In [10]:
df_payments

        id  id_sale dt_payment
0        1        1 2018-01-24
1        2        2 2018-02-17
2        3        3 2018-02-14
3        4        5 2018-01-23
4        5        7 2018-02-15
...    ...      ...        ...
2067  2068     2990 2020-10-04
2068  2069     2992 2020-10-10
2069  2070     2994 2020-10-09
2070  2071     2996 2020-10-17
2071  2072     2997 2020-10-02

[2072 rows x 3 columns]

In [13]:
df_clients_from_csv = pd.read_csv('./csv/case_clients.csv', sep=';')
df_clients_from_csv

       id               name sex  birth_date
0       1      Lavinia Sousa   F    5/2/1975
1       2       Caio Pereira   M   4/16/1978
2       3      Júlio Azevedo   M   11/4/1952
3       4    Sarah Goncalves   F   2/24/1937
4       5  Gabrielle Martins   F    5/6/1953
..    ...                ...  ..         ...
995   996     Ágatha Ribeiro   F    2/8/1946
996   997     Laura Oliveira   F   6/15/1979
997   998      Lara Oliveira   F   3/15/1946
998   999       Julian Cunha   M   6/20/1994
999  1000    Gustavo Barbosa   M  12/30/1975

[1000 rows x 4 columns]